In [169]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [170]:
base

    0  1           2        3                                    4
0   E  1  1999-02-28    b,g,f        jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1   A  2  1999-10-28    a,f,c              ccc:2,ddd:0,aaa:3,hhh:9
2   B  5  1998-05-02  f,e,a,c              ddd:2,ggg:5,ccc:6,jjj:1
3   A  3  1999-08-28      a,b              hhh:9,iii:5,eee:7,bbb:1
4   C  6  1999-12-01  f,g,d,a              iii:6,ddd:5,eee:4,jjj:3
5   A  7  1998-07-28      c,d        bbb:2,hhh:0,ccc:4,fff:1,aaa:7
6   A  9  1997-02-28    g,d,a  aaa:5,fff:8,ddd:2,iii:0,jjj:7,ccc:1
7   B  1  1999-05-10      b,a                    fff:3,hhh:1,ddd:2
8   E  2  1997-04-12  d,e,a,f  eee:4,ccc:5,iii:9,fff:7,ggg:6,bbb:0
9   B  3  1999-11-23  d,b,g,f  bbb:7,jjj:9,fff:5,iii:4,ggg:2,eee:3
10  C  7  1998-01-17  d,c,f,b        hhh:6,eee:4,iii:0,fff:2,jjj:1
11  C  5  1998-12-28  d,e,a,c                    bbb:7,iii:6,ggg:9
12  D  3  1999-10-15  g,e,f,b        bbb:9,aaa:3,ccc:6,fff:4,eee:2
13  E  8  1998-11-01      c,f                    aaa:8,ddd:5,jjj:1
14  B  9  1999-08-12      d,b        ccc:0,jjj:6,fff:7,ddd:3,aaa:2
15  D  1  1997-12-01      f,e              ccc:0,eee:6,bbb:9,ddd:3
16  E  3  1997-07-28    e,b,f  bbb:6,iii:3,hhh:5,fff:4,ggg:9,ddd:2
17  D  5  1998-08-12      g,a                    hhh:4,jjj:5,ccc:9
18  E  8  1999-08-24  e,c,f,a                    ccc:1,iii:6,fff:9
19  E  9  1998-01-23      e,a                    bbb:9,aaa:3,fff:1
20  E  7  1999-06-22      e,f                    ddd:9,iii:2,aaa:4
21  E  3  1999-04-24    c,b,g                    ccc:5,fff:8,iii:7
22  D  5  1999-06-25    c,f,a                    eee:3,jjj:2,ddd:7
23  A  1  1999-08-25    f,a,d        jjj:1,ggg:0,ccc:7,ddd:9,bbb:3
24  E  4  1997-07-26      c,d  jjj:6,ccc:0,aaa:1,hhh:9,iii:7,ggg:8
25  E  6  1997-09-24    e,d,c  fff:3,eee:6,iii:4,bbb:7,ddd:0,ccc:1
26  A  8  1997-09-28    a,e,f                    fff:0,ddd:5,ccc:4
27  E  5  1999-06-22    c,a,g        ggg:6,hhh:3,ddd:9,ccc:0,jjj:7
28  A  6  1999-07-29      f,e        hhh:6,jjj:0,eee:5,iii:7,ccc:3
29  C  0  1999-08-22  f,c,a,g  eee:1,fff:4,aaa:2,ccc:7,ggg:0,ddd:6
30  A  1  1998-04-26      b,f        ccc:6,aaa:9,eee:5,ddd:0,bbb:3
31  D  2  1998-02-24      b,f  bbb:7,hhh:1,aaa:6,iii:4,fff:9,ddd:5
32  E  5  1999-03-24      a,c              fff:3,ccc:1,ggg:2,eee:5
33  B  4  1998-03-23    b,f,c  iii:7,ggg:3,ddd:0,jjj:8,hhh:5,ccc:1
34  B  6  1999-04-21    f,a,e        hhh:6,ccc:3,jjj:0,bbb:8,ddd:7
35  D  7  1999-02-29      a,f                    aaa:0,fff:5,ddd:3
36  B  8  1997-05-21      c,a        ddd:5,jjj:2,iii:7,ccc:0,bbb:4
37  C  9  1997-07-22  c,a,e,f                    eee:0,fff:2,hhh:6
38  E  1  1999-09-28      e,d                    fff:9,iii:2,eee:0
39  E  5  1998-01-26    f,a,d                    hhh:8,ggg:3,jjj:5

# Q01

In [171]:
## Imprima la suma de la segunda columna.

In [172]:
q01 = base[1].sum()
print(q01)

190

# Q02

In [173]:
## Imprima la cantidad de registros por letra para la 
## primera columna, ordenados alfabeticamente.

In [174]:
base.head()

   0  1           2        3                              4
0  E  1  1999-02-28    b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1  A  2  1999-10-28    a,f,c        ccc:2,ddd:0,aaa:3,hhh:9
2  B  5  1998-05-02  f,e,a,c        ddd:2,ggg:5,ccc:6,jjj:1
3  A  3  1999-08-28      a,b        hhh:9,iii:5,eee:7,bbb:1
4  C  6  1999-12-01  f,g,d,a        iii:6,ddd:5,eee:4,jjj:3

In [175]:
q02list = list(base[0])

In [176]:
q02list

['E',
 'A',
 'B',
 'A',
 'C',
 'A',
 'A',
 'B',
 'E',
 'B',
 'C',
 'C',
 'D',
 'E',
 'B',
 'D',
 'E',
 'D',
 'E',
 'E',
 'E',
 'E',
 'D',
 'A',
 'E',
 'E',
 'A',
 'E',
 'A',
 'C',
 'A',
 'D',
 'E',
 'B',
 'B',
 'D',
 'B',
 'C',
 'E',
 'E']

In [177]:
uniqueletters = set(q02list)

In [178]:
uniqueletters

{'A', 'B', 'C', 'D', 'E'}

In [179]:
q02c = [(l, q02list.count(l)) for l in sorted(uniqueletters)]
q02c

[('A', 8), ('B', 7), ('C', 5), ('D', 6), ('E', 14)]

In [180]:
q02c[0][0]

'A'

In [181]:
for i in range(5):
    print(q02c[i][0],q02c[i][1], sep=',')

A,8
B,7
C,5
D,6
E,14

# Q03

In [182]:
## Imprima la suma de la columna 2 por cada letra de la 
## primera columna, ordneados alfabeticamente.

In [183]:
base.head(1)

   0  1           2      3                              4
0  E  1  1999-02-28  b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2

In [184]:
q03c = base.groupby(0).sum()[1]

In [185]:
print(q03c)

0
A    37
B    36
C    27
D    23
E    67
Name: 1, dtype: int64

In [186]:
q03l = list(q03c)

In [187]:
ul = list(uniqueletters)

In [188]:
letters = sorted(uniqueletters)

In [189]:
q03l

[37, 36, 27, 23, 67]

In [190]:
letters

['A', 'B', 'C', 'D', 'E']

In [191]:
for i in range(5):
    print(letters[i], q03l[i], sep=',')

A,37
B,36
C,27
D,23
E,67

# Q04

In [192]:
## Imprima la cantidad de registros por cada mes.
base.head(1)

   0  1           2      3                              4
0  E  1  1999-02-28  b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2

# Q05

In [194]:
#Imprima el valor maximo y minimo por cada letra de la columa 1.
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [195]:
q051 = base.groupby(0).max()[1]
q051

0
A    9
B    9
C    9
D    7
E    9
Name: 1, dtype: int64

In [196]:
q052 = base.groupby(0).min()[1]
q052

0
A    1
B    1
C    0
D    1
E    1
Name: 1, dtype: int64

In [197]:
q051l = list(q051)
q052l = list(q052)

In [198]:
q02list = list(base[0])
uniqueletters = set(q02list)
ul = list(uniqueletters)
letters = sorted(uniqueletters)

In [199]:
for i in range(5):
    print(letters[i], q051l[i], q052l[i], sep=',')

A,9,1
B,9,1
C,9,0
D,7,1
E,9,1

# Q06

In [200]:
## Por cada clave de la columna 5 (cadena de tres letras), obtenga
## el valor mas peque√±o y el valor mas grande asociado a esa clave.
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [205]:
base.head(1)

   0  1           2      3                              4
0  E  1  1999-02-28  b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2

In [207]:
trioletras = base[4]
trioletras1 = list(trioletras)

# Q07

In [209]:
## Genere una lista de tuplas, donde cada tupla contiene en la primera 
## posicion, el valor de la segunda columna; la segunda parte de la 
## tupla es una lista con las letras de la primera columna que aparecen
## asociadas a dicho valor de la segunda columna. Esto es:
##
##    ('0', ['C'])
##    ('1', ['E', 'B', 'D', 'A', 'A', 'E'])
##    ('2', ['A', 'E', 'D'])
##    ('3', ['A', 'B', 'D', 'E', 'E'])
##    ('4', ['E', 'B'])
##    ('5', ['B', 'C', 'D', 'D', 'E', 'E', 'E'])
##    ('6', ['C', 'E', 'A', 'B'])
##    ('7', ['A', 'C', 'E', 'D'])
##    ('8', ['E', 'E', 'A', 'B'])
##    ('9', ['A', 'B', 'E', 'C'])

In [222]:
for i in range(10):
    print(base[i][1],
          for j in range(len(base))
          if base[1][j] = i:
              print(base[0][j])
          else:
              break

SyntaxError: invalid syntax (<ipython-input-222-d3b36bededf4>, line 3)

In [220]:
base[1][1]

2